pass_application_benchmarks/db_bench/linux_500/1757115750_db_bench_7.log
Set seed to 1757115750444205 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       32 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    4000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4028.3 MB (estimated)
FileSize:   2075.2 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: Snappy
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
WARNING: Assertions are enabled; benchmarks unnecessarily slow
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [/mnt/test_disk_7]
fillseq      :      25.951 micros/op 615908 ops/sec 103.912 seconds 64000000 operations;  620.3 MB/s
Set seed to 1757115914751007 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       32 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    4000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4028.3 MB (estimated)
FileSize:   2075.2 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: Snappy
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
WARNING: Assertions are enabled; benchmarks unnecessarily slow
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [/mnt/test_disk_7]
fillsync     :     167.188 micros/op 95596 ops/sec 50.084 seconds 4787840 operations;   96.3 MB/s (4000 ops)
Set seed to 1757116025806336 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       32 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    4000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4028.3 MB (estimated)
FileSize:   2075.2 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: Snappy
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
WARNING: Assertions are enabled; benchmarks unnecessarily slow
------------------------------------------------
DB path: [/mnt/test_disk_7]
overwrite    :      41.928 micros/op 381525 ops/sec 50.022 seconds 19084832 operations;  384.2 MB/s
Set seed to 1757116142127554 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       32 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    4000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4028.3 MB (estimated)
FileSize:   2075.2 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: Snappy
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
WARNING: Assertions are enabled; benchmarks unnecessarily slow
------------------------------------------------
DB path: [/mnt/test_disk_7]
readrandom   :       1.901 micros/op 8417083 ops/sec 50.009 seconds 420929984 operations; (0 of 25391999 found)

Set seed to 1757116258311318 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       32 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    4000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4028.3 MB (estimated)
FileSize:   2075.2 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: Snappy
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
WARNING: Assertions are enabled; benchmarks unnecessarily slow
------------------------------------------------
DB path: [/mnt/test_disk_7]
seekrandom   :       3.400 micros/op 4705502 ops/sec 50.002 seconds 235285984 operations; (0 of 10842999 found)

Set seed to 1757116368364414 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       32 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    4000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4028.3 MB (estimated)
FileSize:   2075.2 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: Snappy
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
WARNING: Assertions are enabled; benchmarks unnecessarily slow
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [/mnt/test_disk_7]
fillrandom   :      36.709 micros/op 435795 ops/sec 50.018 seconds 21797792 operations;  438.9 MB/s